## Importing Pandas

In [ ]:
# !pip install pandas

In [17]:
import pandas as pd

## Version

In [18]:
import sys
print(sys.version)

3.8.8 (default, Apr 13 2021, 15:08:03) [MSC v.1916 64 bit (AMD64)]

In [19]:
print(pd.__version__)

2.0.1

In [51]:
pd._version

## Upgrade

In [48]:
!pip install --upgrade pandas

Requirement already satisfied: pandas in c:\users\shant\anaconda3\lib\site-packages (2.0.1)

ERROR: Could not install packages due to an OSError: [WinError 5] Access is denied: 'C:\\Users\\shant\\anaconda3\\Lib\\site-packages\\~andas\\_libs\\algos.cp38-win_amd64.pyd'
Consider using the `--user` option or check the permissions.

Collecting pandas
  Downloading pandas-2.0.3-cp38-cp38-win_amd64.whl (10.8 MB)
Requirement already satisfied: tzdata>=2022.1 in c:\users\shant\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\shant\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.20.3 in c:\users\shant\anaconda3\lib\site-packages (from pandas) (1.22.4)
Requirement already satisfied: pytz>=2020.1 in c:\users\shant\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\shant\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.15.0)
Installing collected packages: pandas
  Attempting uninstall: pandas
    Found existing installation: pandas 2.0.1
    Uninstalling pandas-2.0.1:
      Successfully uninstalled pandas-2.0.1

In [56]:
# !pip install pandas==2.1

In [49]:
pd.__version__

'2.0.1'

In [50]:
!pip list

Package                            Version
---------------------------------- -------------------
alabaster                          0.7.12
anaconda-client                    1.7.2
anaconda-navigator                 2.0.3
anaconda-project                   0.9.1
anyio                              2.2.0
appdirs                            1.4.4
argh                               0.26.2
argon2-cffi                        20.1.0
asn1crypto                         1.4.0
astroid                            2.5
astropy                            4.2.1
async-generator                    1.10
atomicwrites                       1.4.0
attrs                              20.3.0
autopep8                           1.5.6
Babel                              2.9.0
backcall                           0.2.0
backports.functools-lru-cache      1.6.4
backports.shutil-get-terminal-size 1.0.0
backports.tempfile                 1.0
backports.weakref                  1.0.post1
bcrypt                             3.2.0
beautifulsoup4                     4.12.2
bitarray                           1.9.2
bkcharts                           0.2
black                              19.10b0
bleach                             3.3.0
bokeh                              2.3.2
boto                               2.49.0
Bottleneck                         1.3.2
brotlipy                           0.7.0
certifi                            2020.12.5
cffi                               1.14.5
chardet                            4.0.0
charset-normalizer                 3.1.0
click                              7.1.2
cloudpickle                        1.6.0
clyent                             1.2.2
colorama                           0.4.4
comtypes                           1.1.9
conda                              4.13.0
conda-build                        3.21.4
conda-content-trust                0+unknown
conda-package-handling             1.7.3
conda-repo-cli                     1.0.4
conda-token                        0.3.0
conda-verify                       3.4.2
contextlib2                        0.6.0.post1
cryptography                       3.4.7
cycler                             0.10.0
Cython                             0.29.23
cytoolz                            0.11.0
dask                               2021.4.0
decorator                          5.0.6
defusedxml                         0.7.1
diff-match-patch                   20200713
distributed                        2021.4.0
docutils                           0.17
entrypoints                        0.3
et-xmlfile                         1.0.1
fastcache                          1.1.0
filelock                           3.0.12
flake8                             3.9.0
Flask                              1.1.2
frozendict                         2.3.8
fsspec                             0.9.0
future                             0.18.2
gevent                             21.1.2
glob2                              0.7
greenlet                           1.0.0
h5py                               2.10.0
HeapDict                           1.0.1
html5lib                           1.1
idna                               2.10
imagecodecs                        2021.3.31
imageio                            2.9.0
imagesize                          1.2.0
importlib-metadata                 3.10.0
iniconfig                          1.1.1
intervaltree                       3.1.0
ipykernel                          5.3.4
ipython                            7.22.0
ipython-genutils                   0.2.0
ipywidgets                         7.6.3
isort                              5.8.0
itsdangerous                       1.1.0
jdcal                              1.4.1
jedi                               0.17.2
Jinja2                             2.11.3
joblib                             1.2.0
json5                              0.9.5
jsonschema                         3.2.0
jupyter                            1.0.0
jupyter-client                     6.1.12
jupyter-console                    6.4.0
jupyter-contrib-core               0.3.3
jupyter-contrib-nbextensions       0.5.1
jupyter-core                       4.7.1
jupyter-highlight-selected-word    0.2.0
jupyter-latex-envs                 1.4.6
jupyter-nbextensions-configurator  0.4.1
jupyter-packaging                  0.7.12
jupyter-server                     1.4.1
jupyterlab                         3.0.14
jupyterlab-pygments                0.1.2
jupyterlab-server                  2.4.0
jupyterlab-widgets                 1.0.0
jupyterthemes                      0.20.0
keyring                            22.3.0
kiwisolver                         1.3.1
lazy-object-proxy                  1.6.0
lesscpy                            0.15.0
libarchive-c                       2.9
llvmlite                           0.36.0
locket                             0.2.1
lxml                               4.9.2
MarkupSafe                         1.1.1
matplotlib                         3.3.4
mccabe                             0.6.1
menuinst                           1.4.16
missingno                          0.5.2
mistune                            0.8.4
mkl-fft                            1.3.0
mkl-random                         1.2.1
mkl-service                        2.3.0
mock                               4.0.3
more-itertools                     8.7.0
mpmath                             1.2.1
msgpack                            1.0.2
multipledispatch                   0.6.0
multitasking                       0.0.11
mypy-extensions                    0.4.3
navigator-updater                  0.2.1
nbclassic                          0.2.6
nbclient                           0.5.3
nbconvert                          6.0.7
nbformat                           5.1.3
nest-asyncio                       1.5.1
networkx                           2.5
nltk                               3.6.1
nose                               1.3.7
notebook                           6.3.0
numba                              0.53.1
numexpr                            2.7.3
numpy                              1.22.4
numpydoc                           1.1.0
olefile                            0.46
openpyxl                           3.0.7
packaging                          20.9
pandas                             2.0.3
pandas-datareader                  0.10.0
pandocfilters                      1.4.3
paramiko                           2.7.2
parso                              0.7.0
partd                              1.2.0
path                               15.1.2
pathlib2                           2.3.5
pathspec                           0.7.0
patsy                              0.5.1
pep8                               1.7.1
pexpect                            4.8.0
pickleshare                        0.7.5
Pillow                             8.2.0
pip                                21.0.1
pkginfo                            1.7.0
pluggy                             0.13.1
ply                                3.11
prometheus-client                  0.10.1
prompt-toolkit                     3.0.17
psutil                             5.8.0
ptyprocess                         0.7.0
py                                 1.10.0
pycodestyle                        2.6.0
pycosat                            0.6.3
pycparser                          2.20
pycurl                             7.43.0.6
pydocstyle                         6.0.0
pyerfa                             1.7.3
pyflakes                           2.2.0
Pygments                           2.8.1
pylint                             2.7.4
pyls-black                         0.4.6
pyls-spyder                        0.3.2
PyNaCl                             1.4.0
pyodbc                             4.0.0-unsupported
pyOpenSSL                          20.0.1
pyparsing                          2.4.7
pyreadline                         2.1
pyrsistent                         0.17.3
PySocks                            1.7.1
pytest                             6.2.3
python-dateutil                    2.8.2
python-jsonrpc-server              0.4.0
python-language-server             0.36.2
pytz                               2023.3
PyWavelets                         1.1.1
pywin32                            227
pywin32-ctypes                     0.2.0
pywinpty                           0.5.7
PyYAML                             5.4.1
pyzmq                              20.0.0
QDarkStyle                         2.8.1
QtAwesome                          1.0.2
qtconsole                          5.0.3
QtPy                               1.9.0
regex                              2021.4.4
requests                           2.31.0
rope                               0.18.0
Rtree                              0.9.7
ruamel-yaml-conda                  0.15.100
scikit-image                       0.18.1
scikit-learn                       1.2.2
scipy                              1.6.2
seaborn                            0.11.1
Send2Trash                         1.5.0
setuptools                         52.0.0.post20210125
simplegeneric                      0.8.1
singledispatch                     0.0.0
sip                                4.19.13
six                                1.15.0
SKompiler                          0.7
sniffio                            1.2.0
snowballstemmer                    2.1.0
sortedcollections                  2.1.0
sortedcontainers                   2.3.0
soupsieve                          2.2.1
Sphinx                             4.0.1
sphinxcontrib-applehelp            1.0.2
sphinxcontrib-devhelp              1.0.2
sphinxcontrib-htmlhelp             1.0.3
sphinxcontrib-jsmath               1.0.1
sphinxcontrib-qthelp               1.0.3
sphinxcontrib-serializinghtml      1.1.4
sphinxcontrib-websupport           1.2.4
spyder                             4.2.5
spyder-kernels                     1.10.2
SQLAlchemy                         1.4.7
statsmodels                        0.12.2
sympy                              1.8
tables                             3.6.1
tblib                              1.7.0
terminado                          0.9.4
testpath                           0.4.4
textdistance                       4.2.1
threadpoolctl                      2.1.0
three-merge                        0.1.1
tifffile                           2021.4.8
toml                               0.10.2
toolz                              0.11.1
torch                              2.0.0
tornado                            6.1
tqdm                               4.59.0
traitlets                          5.0.5
typed-ast                          1.4.2
typing-extensions                  3.7.4.3
tzdata                             2023.3
ujson                              4.0.2
unicodecsv                         0.14.1
urllib3                            1.26.4
watchdog                           1.0.2
wcwidth                            0.2.5
webencodings                       0.5.1
Werkzeug                           1.0.1
wheel                              0.36.2
widgetsnbextension                 3.5.1
win-inet-pton                      1.1.0
win-unicode-console                0.5
wincertstore                       0.2
wordcloud                          1.8.2.2
wrapt                              1.12.1
xlrd                               2.0.1
XlsxWriter                         1.3.8
xlwings                            0.23.0
xlwt                               1.3.0
xmltodict                          0.12.0
yapf                               0.31.0
ycimpute                           0.2
yellowbrick                        1.5
yfinance                           0.2.18
zict                               2.0.0
zipp                               3.4.1
zope.event                         4.5.0
zope.interface                     5.3.0

## Pandas Series

In [23]:
#empty series
s = pd.Series()
print(type(s))
s

<class 'pandas.core.series.Series'>

Series([], dtype: object)

In [24]:
s1 = pd.Series([10,20,30,40])

In [25]:
s1.ndim

1

In [27]:
s1.size

4

In [29]:
s1[1]

20

In [33]:
s1.head(5)

0    10
1    20
2    30
3    40
dtype: int64

In [36]:
s2 =  pd.Series([1,2,3,4,5] , index=['a','b','c','d','e'])
s2

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [37]:
dic1 = {"ABC":42 , "DEF":93 , "GHI":21}
print(type(dic1))
dic1

<class 'dict'>

{'ABC': 42, 'DEF': 93, 'GHI': 21}

In [41]:
x = pd.Series(dic1)
print(type(x))
x

<class 'pandas.core.series.Series'>

ABC    42
DEF    93
GHI    21
dtype: int64

In [40]:
import numpy as np

In [42]:
s1 = np.array([1,2,3,4,5,6])

In [47]:
print(type(s1))
s2 = pd.Series(s1)
print(type(s2))
s2

<class 'numpy.ndarray'>
<class 'pandas.core.series.Series'>

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int32

## Dataframe

In [57]:
arr1 = np.array([1,2,3,4,5,6,7,8,9]).reshape(3,3)

In [59]:
pd.DataFrame(arr1 , columns=["var1","var2","var3"])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [60]:
dic2 = {"Name":["Niraj" , "Dharmendra" , "Gowtham"] , "Age":[34,35,36]}

In [63]:
df = pd.DataFrame(dic2)

In [75]:
df.ndim

2

In [76]:
df.size

6

In [77]:
df.dtypes

Name    object
Age      int64
dtype: object

In [74]:
df.shape

(3, 2)

In [64]:
type(df)

pandas.core.frame.DataFrame

In [65]:
df.head(2)

         Name  Age
0       Niraj   34
1  Dharmendra   35

In [66]:
df.tail(2)

         Name  Age
1  Dharmendra   35
2     Gowtham   36

In [68]:
df.dtypes

Name    object
Age      int64
dtype: object

In [69]:
df.Name

0         Niraj
1    Dharmendra
2       Gowtham
Name: Name, dtype: object

In [70]:
df['Name']

0         Niraj
1    Dharmendra
2       Gowtham
Name: Name, dtype: object

In [71]:
df['Name'][1]

'Dharmendra'

In [73]:
df["Name"]

0         Niraj
1    Dharmendra
2       Gowtham
Name: Name, dtype: object

## Dataset import

In [78]:
%pwd

'C:\\Users\\shant\\Desktop'

In [143]:
cars = pd.read_csv('mtcars2.csv')

In [144]:
type(cars)

pandas.core.frame.DataFrame

In [145]:
cars.head(10)  # by fefault its 5

,S.No,Unnamed: 1,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,1,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,2,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,3,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,4,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,5,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2
5,6,Valiant,18.1,6,225.0,105,2.76,3.460,NaN,1,0,3,1
6,7,Duster 360,14.3,8,360.0,245,3.21,3.570,15.84,0,0,3,4
7,8,Merc 240D,24.4,4,146.7,62,3.69,3.190,20.00,1,0,4,2
8,9,Merc 230,22.8,4,140.8,95,3.92,3.150,22.90,1,0,4,2
9,10,Merc 280,19.2,6,167.6,123,3.92,3.440,18.30,1,0,4,4

In [146]:
cars.dtypes

S.No            int64
Unnamed: 1     object
mpg           float64
cyl             int64
disp          float64
hp              int64
drat          float64
wt            float64
qsec          float64
vs              int64
am              int64
gear            int64
carb            int64
dtype: object

In [147]:
cars.shape

(32, 13)

In [148]:
cars.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32 entries, 0 to 31
Data columns (total 13 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   S.No        32 non-null     int64
 1   Unnamed: 1  32 non-null     object
 2   mpg         32 non-null     float64
 3   cyl         32 non-null     int64
 4   disp        32 non-null     float64
 5   hp          32 non-null     int64
 6   drat        32 non-null     float64
 7   wt          32 non-null     float64
 8   qsec        29 non-null     float64
 9   vs          32 non-null     int64
 10  am          32 non-null     int64
 11  gear        32 non-null     int64
 12  carb        32 non-null     int64
dtypes: float64(5), int64(7), object(1)
memory usage: 3.4+ KB

In [149]:
df.describe()

,S.No,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
count,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,29.000000,32.000000,32.000000,32.000000,32.0000
mean,16.500000,20.090625,6.187500,230.721875,146.687500,3.596563,3.217250,17.674828,0.437500,0.406250,3.687500,2.8125
std,9.380832,6.026948,1.785922,123.938694,68.562868,0.534679,0.978457,1.780394,0.504016,0.498991,0.737804,1.6152
min,1.000000,10.400000,4.000000,71.100000,52.000000,2.760000,1.513000,14.500000,0.000000,0.000000,3.000000,1.0000
25%,8.750000,15.425000,4.000000,120.825000,96.500000,3.080000,2.581250,16.870000,0.000000,0.000000,3.000000,2.0000
50%,16.500000,19.200000,6.000000,196.300000,123.000000,3.695000,3.325000,17.420000,0.000000,0.000000,4.000000,2.0000
75%,24.250000,22.800000,8.000000,326.000000,180.000000,3.920000,3.610000,18.600000,1.000000,1.000000,4.000000,4.0000
max,32.000000,33.900000,8.000000,472.000000,335.000000,4.930000,5.424000,22.900000,1.000000,1.000000,5.000000,8.0000

In [150]:
cars.head()

,S.No,Unnamed: 1,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,1,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,2,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,3,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,4,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,5,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

In [151]:
cars = cars.rename(columns={"Unnamed: 1" : "model"})

In [152]:
cars.head()

,S.No,model,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,1,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,2,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,3,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,4,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,5,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

In [153]:
cars.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32 entries, 0 to 31
Data columns (total 13 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   S.No    32 non-null     int64
 1   model   32 non-null     object
 2   mpg     32 non-null     float64
 3   cyl     32 non-null     int64
 4   disp    32 non-null     float64
 5   hp      32 non-null     int64
 6   drat    32 non-null     float64
 7   wt      32 non-null     float64
 8   qsec    29 non-null     float64
 9   vs      32 non-null     int64
 10  am      32 non-null     int64
 11  gear    32 non-null     int64
 12  carb    32 non-null     int64
dtypes: float64(5), int64(7), object(1)
memory usage: 3.4+ KB

In [154]:
cars.qsec.isna().sum()

3

In [155]:
cars.qsec = cars.qsec.fillna(cars.qsec.mean())

In [156]:
print(cars.qsec.isna().sum())
cars.info()

0
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32 entries, 0 to 31
Data columns (total 13 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   S.No    32 non-null     int64
 1   model   32 non-null     object
 2   mpg     32 non-null     float64
 3   cyl     32 non-null     int64
 4   disp    32 non-null     float64
 5   hp      32 non-null     int64
 6   drat    32 non-null     float64
 7   wt      32 non-null     float64
 8   qsec    32 non-null     float64
 9   vs      32 non-null     int64
 10  am      32 non-null     int64
 11  gear    32 non-null     int64
 12  carb    32 non-null     int64
dtypes: float64(5), int64(7), object(1)
memory usage: 3.4+ KB

In [157]:
l1= list(cars.columns)

In [125]:
for i in l1:
#     print(i)
    print("missing values for: "+str(i)+": "+str(cars[i].isna().sum()))

missing values for: S.No: 0
missing values for: model: 0
missing values for: mpg: 0
missing values for: cyl: 0
missing values for: disp: 0
missing values for: hp: 0
missing values for: drat: 0
missing values for: wt: 0
missing values for: qsec: 0
missing values for: vs: 0
missing values for: am: 0
missing values for: gear: 0
missing values for: carb: 0

In [158]:
cars.head()

,S.No,model,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,1,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,2,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,3,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,4,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,5,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

In [159]:
cars.to_csv("updated_cars.csv",index=False)

In [160]:
upd_car = pd.read_csv("updated_cars.csv" , index_col=False)

In [161]:
upd_car.head()

,S.No,model,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,1,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,2,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,3,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,4,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,5,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

In [141]:
upd_car = upd_car.drop(columns=['Unnamed: 0'])

In [142]:
upd_car.head()

,S.No,model,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,1,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,2,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,3,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,4,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,5,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

## loc and iloc

In [164]:
df = pd.DataFrame({"Name": ['josh','Mike','Ana','Hana'] , "Income" : [5000,6000,7000,9000]})

In [165]:
df.head()

   Name  Income
0  josh    5000
1  Mike    6000
2   Ana    7000
3  Hana    9000

In [166]:
df.iloc[0]

Name      josh
Income    5000
Name: 0, dtype: object

In [168]:
df.iloc[1:3]

   Name  Income
1  Mike    6000
2   Ana    7000

In [169]:
df.iloc[0:6]

   Name  Income
0  josh    5000
1  Mike    6000
2   Ana    7000
3  Hana    9000

In [170]:
df.loc[0]

Name      josh
Income    5000
Name: 0, dtype: object

In [171]:
df.loc[:'Income']

   Name  Income
0  josh    5000
1  Mike    6000
2   Ana    7000
3  Hana    9000

In [173]:
df = pd.DataFrame({"Name": ['josh','Mike','Ana','Hana'] , "Income" : [5000,6000,7000,9000] , "Age":[35,19,26,32]}, index = ['a','b','c','d'])

In [174]:
df.head()

   Name  Income  Age
a  josh    5000   35
b  Mike    6000   19
c   Ana    7000   26
d  Hana    9000   32

In [175]:
df.loc['b','Name']

'Mike'

- df.loc[row_label , column_label]
- df.iloc[row_position , column_position]

In [177]:
df.loc['a':'c','Age']   # we cannot subtract from a label so stop will not be stop-1 here

a    35
b    19
c    26
Name: Age, dtype: int64

In [178]:
df.iloc[[1,3],[1,2]]

   Income  Age
b    6000   19
d    9000   32

In [179]:
df.iloc[0:3 , 0]

a    josh
b    Mike
c     Ana
Name: Name, dtype: object

In [182]:
# df.loc[1:3]   # cant use indexes in loc

In [185]:
df.loc[['b','d']]

   Name  Income  Age
b  Mike    6000   19
d  Hana    9000   32

## Accessing columns of the dataframe

In [188]:
df["Age"][1]

19

In [189]:
df[["Age","Name"]]

   Age  Name
a   35  josh
b   19  Mike
c   26   Ana
d   32  Hana

In [190]:
df.sort_values(by=['Age'])

   Name  Income  Age
b  Mike    6000   19
c   Ana    7000   26
d  Hana    9000   32
a  josh    5000   35

## Assigning a value to a specific row

In [191]:
df = pd.DataFrame({"Name": ['josh','Mike','Ana','Hana'] , "Income" : [5000,6000,7000,9000] , "Age":[35,19,26,32]})

In [192]:
df.head()

   Name  Income  Age
0  josh    5000   35
1  Mike    6000   19
2   Ana    7000   26
3  Hana    9000   32

In [193]:
df.iloc[0] = ["Berk",9000,45]

In [194]:
df.head()

   Name  Income  Age
0  Berk    9000   45
1  Mike    6000   19
2   Ana    7000   26
3  Hana    9000   32

In [207]:
df = pd.DataFrame({"Name": ['josh','Mike','Ana','Hana'] , "Income" : [5000,6000,7000,9000] , "Age":[35,19,26,32]}, index = ['a','b','c','d'])

In [208]:
df.head()

   Name  Income  Age
a  josh    5000   35
b  Mike    6000   19
c   Ana    7000   26
d  Hana    9000   32

In [210]:
df.reset_index(inplace=True , drop=True )

In [211]:
df.head()

   Name  Income  Age
0  josh    5000   35
1  Mike    6000   19
2   Ana    7000   26
3  Hana    9000   32

In [214]:
df = df.sort_values(by=['Age'])
df

   Name  Income  Age
1  Mike    6000   19
2   Ana    7000   26
3  Hana    9000   32
0  josh    5000   35

In [217]:
df.reset_index(inplace=True , drop=True)
df

   Name  Income  Age
0  Mike    6000   19
1   Ana    7000   26
2  Hana    9000   32
3  josh    5000   35

## Filtering

In [222]:
df.head()

   Name  Income  Age
0  Mike    6000   19
1   Ana    7000   26
2  Hana    9000   32
3  josh    5000   35

In [218]:
cond = df["Age"] > 30

In [219]:
df[cond]

   Name  Income  Age
2  Hana    9000   32
3  josh    5000   35

In [224]:
df[df["Income"]>6000]

   Name  Income  Age
1   Ana    7000   26
2  Hana    9000   32

## Merging

In [227]:
df1 = pd.DataFrame({"Name": ['josh','Mike','Ana','Hana'],
                   "Department":["IT","HR","Finance","Supplychain"],
                  "Income":[5000,7000,8000,6000],
                  "Age":[35,19,45,67]})

df2 = pd.DataFrame({"Name": ['Berk','Mich','Chris','Fed'],
                   "Department":["Finance","Marketing","Hr","Law"],
                  "Income":[5700,7900,8090,6300],
                  "Age":[35,19,85,42]})

In [229]:
df1.head()

   Name   Department  Income  Age
0  josh           IT    5000   35
1  Mike           HR    7000   19
2   Ana      Finance    8000   45
3  Hana  Supplychain    6000   67

In [230]:
df2.head()

    Name Department  Income  Age
0   Berk    Finance    5700   35
1   Mich  Marketing    7900   19
2  Chris         Hr    8090   85
3    Fed        Law    6300   42

In [231]:
pd.concat([df1,df2])

    Name   Department  Income  Age
0   josh           IT    5000   35
1   Mike           HR    7000   19
2    Ana      Finance    8000   45
3   Hana  Supplychain    6000   67
0   Berk      Finance    5700   35
1   Mich    Marketing    7900   19
2  Chris           Hr    8090   85
3    Fed          Law    6300   42

In [232]:
pd.concat([df1,df2] , ignore_index=True)

    Name   Department  Income  Age
0   josh           IT    5000   35
1   Mike           HR    7000   19
2    Ana      Finance    8000   45
3   Hana  Supplychain    6000   67
4   Berk      Finance    5700   35
5   Mich    Marketing    7900   19
6  Chris           Hr    8090   85
7    Fed          Law    6300   42

## Joins

In [236]:
df1 = pd.DataFrame({"Name": ['josh','Mike','Ana','Hana'],
                   "Department":[1,2,3,4],
                  "Age":[35,19,45,67]})

df2 = pd.DataFrame({"Name": ['Berk','Mich','Chris','Fed'],
                   "Department":[2,3,4,5],
                  "Age":[35,19,85,42]})

In [237]:
pd.merge(df1,df2 , on='Department' , how = 'inner')

  Name_x  Department  Age_x Name_y  Age_y
0   Mike           2     19   Berk     35
1    Ana           3     45   Mich     19
2   Hana           4     67  Chris     85

In [238]:
pd.merge(df1,df2 , on='Department' , how = 'outer')

  Name_x  Department  Age_x Name_y  Age_y
0   josh           1   35.0    NaN    NaN
1   Mike           2   19.0   Berk   35.0
2    Ana           3   45.0   Mich   19.0
3   Hana           4   67.0  Chris   85.0
4    NaN           5    NaN    Fed   42.0

In [240]:
df1 = pd.DataFrame({"Name": ['josh','Mike','Ana','Hana'],
                   "Department":[1,2,3,4]})

df2 = pd.DataFrame({"Name": ['Berk','Mich','Chris','Fed'],
                   "Department":[2,3,4,5],
                  "Age":[35,19,85,42]})

In [241]:
pd.merge(df1,df2 , on='Department' , how = 'left')

  Name_x  Department Name_y   Age
0   josh           1    NaN   NaN
1   Mike           2   Berk  35.0
2    Ana           3   Mich  19.0
3   Hana           4  Chris  85.0

## Aggregation FUnction

In [249]:
df1 = pd.DataFrame({"Name": ['josh','Mike','Ana','Hana'],
                   "Department":["IT","HR","IT","Supplychain"],
                  "Income":[5000,7000,8000,6000],
                  "Age":[35,19,45,67]})

In [243]:
df1.count()

Name          4
Department    4
Income        4
Age           4
dtype: int64

In [246]:
df.mean(numeric_only=True)

Income    6750.0
Age         28.0
dtype: float64

In [251]:
df1['Department'].value_counts(normalize=True)

Department
IT             0.50
HR             0.25
Supplychain    0.25
Name: proportion, dtype: float64

In [253]:
df1['Income'].median()

6500.0

In [255]:
df1.groupby('Department').sum()["Income"]

Department
HR              7000
IT             13000
Supplychain     6000
Name: Income, dtype: int64

In [259]:
df1.groupby('Department').max()["Age"]

Department
HR             19
IT             45
Supplychain    67
Name: Age, dtype: int64

In [260]:
df1.groupby('Department')["Income"].agg(["mean","max","median"])

               mean   max  median
Department
HR           7000.0  7000  7000.0
IT           6500.0  8000  6500.0
Supplychain  6000.0  6000  6000.0

## Apply

In [261]:
df1.head()

   Name   Department  Income  Age
0  josh           IT    5000   35
1  Mike           HR    7000   19
2   Ana           IT    8000   45
3  Hana  Supplychain    6000   67

In [264]:
df1['Name'].apply(len)

0    4
1    4
2    3
3    4
Name: Name, dtype: int64

In [265]:
df1['Age'].apply(lambda x : x+1)

0    36
1    20
2    46
3    68
Name: Age, dtype: int64

In [266]:
df.apply(np.sum)

Name      MikeAnaHanajosh
Income              27000
Age                   112
dtype: object

In [268]:
df1.groupby("Department")["Income"].apply(np.sum)

Department
HR              7000
IT             13000
Supplychain     6000
Name: Income, dtype: int64

In [271]:
df1.pivot_table("Income" , index="Department",columns="Name")

Name            Ana    Hana    Mike    josh
Department
HR              NaN     NaN  7000.0     NaN
IT           8000.0     NaN     NaN  5000.0
Supplychain     NaN  6000.0     NaN     NaN